//***********************************************************************************
//!	ファイル名		Class_BackSky.cpp
//
//	機能			チュートリアルの背景の実装
//	記述			上岡　純
//	プロジェクト	未定
//	更新			2008/09/26	<新規>
//***********************************************************************************

//-----------------------------------------------------------------------
//!	インターフェイスヘッダー
//-----------------------------------------------------------------------
#include	"Precompiler.h"

//#include	"Class_BackSky.h"

//-----------------------------------------------------------------------
//!	3Dオブジェクトの名前空間
//-----------------------------------------------------------------------
namespace O3D
{
	//================================================================================
	//!	メソッド名	CBACK_SKY::コンストラクタ
	//
	//	引数		inViewPoint		生成時のカメラ視点
	//	更新		2008/09/26		<新規>
	//================================================================================
	CBACK_SKY::CBACK_SKY(CONST DEV inDev, VEC3* inViewPoint)	:
	CBACK(inViewPoint)
	{
	//	背景テクスチャの生成
		this->sky	= new CMESH(inDev, NAME_SKY);
		this->sky->setLoc(&(*inViewPoint+VEC3(0.0f,0.0f,0.0f)));
	}

	//================================================================================
	//!	メソッド名	CBACK_SKY::デストラクタ
	//
	//	更新		2008/09/26		<新規>
	//================================================================================
	CBACK_SKY::~CBACK_SKY(void)
	{
		SAFE_DELETE(this->sky);
	}
	
	//================================================================================
	//!	メソッド名	CBACK_SKY::motion
	//
	//	機能		背景動作
	//	引数		inViewPoint		現在の視点
	//	更新		2008/09/26		<新規>
	//================================================================================
	void
	CBACK_SKY::motion(VEC3* inViewPoint)
	{
	//	回転値を設定
		this->sky->calcAngleY((this->currViewPoint.x - inViewPoint->x) * 0.002f);
		this->currViewPoint		 = *inViewPoint;

	//	空のメッシュに位置を設定
		this->sky->setLoc(&this->currViewPoint);
	}

	//================================================================================
	//!	メソッド名	CBACK_SKY::worldDraw
	//
	//	機能		背景描画
	//	引数		inDev			Direct3Dデバイス
	//				inSprite		スプライトデバイス
	//	戻り値		TRUE			描画成功
	//				FALSE			描画失敗
	//	更新		2008/09/26		<新規>
	//================================================================================
	BOOL
	CBACK_SKY::drawBack(CONST DEV inDev, CONST SPRITE inSprite)
	{
	//	ライティングを無効
		inDev->SetRenderState(D3DRS_LIGHTING, FALSE);
	//	空の描画
		this->sky->draw(inDev);
	//	ライティングを有効
		inDev->SetRenderState(D3DRS_LIGHTING, TRUE);
		return	TRUE;
	}
}
//-----------------------------------------------------------------------
//!	3Dオブジェクトの名前空間
//-----------------------------------------------------------------------