//***********************************************************************************
//!	ファイル名		Class_Spline.cpp
//
//	機能			スプライン計算をするクラスの実装
//	記述			上岡　純
//	プロジェクト	未定
//	更新			2008/06/04	<新規>
//					2008/09/15	<修正>	コメント
//***********************************************************************************

//-----------------------------------------------------------------------
//!	インターフェイスヘッダー
//-----------------------------------------------------------------------
#include	"Precompiler.h"

//#include	"Class_Spline.h"

//-----------------------------------------------------------------------
//!	スプラインの名前空間
//-----------------------------------------------------------------------
namespace SPL
{
	//================================================================================
	//!	メソッド名	CSPLINE::setUp
	//
	//	機能		三点間の頂点数の配列を確保
	//	引数		inMax			新たな頂点数
	//	更新		2008/06/04		<新規>
	//================================================================================
	void CSPLINE::setMax(DWORD inMax)
	{
		iMaxCnt	= inMax;						//!< 頂点数をint型で確保
		SAFE_DELETE_ARRAY(vSpline);				//!< 先に前の配列情報を開放
		vSpline	= new D3DXVECTOR3[iMaxCnt + 1];	//!< 新たに配列を確保
	}

	//================================================================================
	//!	メソッド名	CSPLINE::setUp
	//
	//	機能		三つの頂点からスプライン曲線を計算、新たに頂点数を変更する事も可能
	//	引数		inPosFirst		頂点１
	//				inPosSecond		頂点２
	//				inPosThird		頂点３
	//				inMax = 0		新たな頂点数(0なら無効)
	//	更新		2008/06/04		<新規>
	//================================================================================
	void CSPLINE::setUp(D3DXVECTOR3*	inPosFirst,
						D3DXVECTOR3*	inPosSecond,
						D3DXVECTOR3*	inPosThird,
						DWORD			inMax)
	{
	//	新たに頂点数を指定された時、新たに頂点配列を確保
		if(	inMax != 0)	setMax(inMax);

		float	a = 1.0f / iMaxCnt;		//!< 頂点と頂点の間隔
		float	f;						//!< 現在の頂点の位置
		int		i;						//!< ループカウンタ

	//	スプライン頂点配列の計算
		for(f = 0.0f, i = 0; i < iMaxCnt; f += a, i++)
		{
			vSpline[i].x = (((1.0f - f) * (1.0f - f)) * inPosFirst->x) + (2 * (f * (1.0f - f)) * inPosSecond->x) + (f * f * inPosThird->x);
			vSpline[i].y = (((1.0f - f) * (1.0f - f)) * inPosFirst->y) + (2 * (f * (1.0f - f)) * inPosSecond->y) + (f * f * inPosThird->y);
			vSpline[i].z = (((1.0f - f) * (1.0f - f)) * inPosFirst->z) + (2 * (f * (1.0f - f)) * inPosSecond->z) + (f * f * inPosThird->z);
		}
	}

	//================================================================================
	//!	メソッド名	CSPLINE::getPos
	//
	//	機能		配列要素数を指定して頂点を受け取る
	//	引数		inTarget		対象頂点
	//	戻り値		D3DXVECTOR3*	頂点ポインタ
	//	更新		2008/06/04		<新規>
	//================================================================================
	D3DXVECTOR3* CSPLINE::getPos(DWORD inTarget)
	{
	//	対象頂点が存在する
		if(	iMaxCnt > (int)inTarget)
		{
		//	頂点を返す
			return	&vSpline[inTarget];
		}
	//	対象頂点が存在しない
		else
		{
		//	NULLを返す
			return	NULL;
		}
	}
}
//-----------------------------------------------------------------------
//!	スプラインの名前空間
//-----------------------------------------------------------------------