//***********************************************************************************
/*!	\file		Class_GameApplication.h
 *
 *	\brief		ゲームアプリケーションの定義.
 *
 *　ゲームアプリケーションに関する定義.
 *
 *	\author		上岡　純
 *	\version	KageTokiGIRL
 *	\date		2008/04/17	<新規>
 */
//***********************************************************************************

#pragma	once

//-----------------------------------------------------------------------
//	シーン分岐フラグ
//-----------------------------------------------------------------------
#include	"GameCommon.h"					//<	ゲームコモン
#include	"Class_Scene.h"					//<	シーン
#include	"Class_Sound_OggVorbis.h"		//<	oggライブラリ(初期化する為)

//-----------------------------------------------------------------------
//	ゲームアプリケーションの名前空間
//-----------------------------------------------------------------------
namespace GAPP
{
	//::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
	//	クラス名		CGAME_APPLICATION
	//
	//	機能			ゲームアプリケーション
	//	更新			2008/04/17	<新規>
	//::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
	class	CGAME_APPLICATION
	{
			//==================================================================
			//	アプリケーションで使用するフォントパス
			//==================================================================
				#define	NAME_FONT1		"..//Resources//Font//HGRPP1.TTC"
				#define	NAME_FONT2		"..//Resources//Font//HGRPP1_0.TTC"

	private:		//-------------------- private --------------------//

			//==================================================================
			//	中枢インスタンス
			//==================================================================
		static	CGAME_APPLICATION*		gUniqueInstance;

			//==================================================================
			//	ゲームを構築する属性
			//==================================================================
				SCENE_FLAG				scenePrevFlag;				//<	前回のゲームフラグ
				SCENE_FLAG				sceneCurrFlag;				//<	現在のゲームフラグ
				HWND					hWnd;						//<	ウィンドウハンドル
				SCE::CSCENE*			scene;						//<	シーンポインター
				CINPUT*					inputKeyBoard;				//<	キーボード入力
				CINPUT*					inputGamePad;				//<	ゲームパッド入力
				SCENE_SHARE_DATA		sShareData;					//<	共有データ

			//==================================================================
			//	各親インスタンス生成場所
			//==================================================================
				C3D_EFFECT_CENTER*		effectCenterInstance;		//<	エフェクトセンター
				CSOUND*					soundInstance;				//<	サウンド

				CGAME_APPLICATION(HWND inWnd);						//<	コンストラクタ
				~CGAME_APPLICATION(void);							//<	デストラクタ

	public:			//-------------------- public --------------------//

		static	CGAME_APPLICATION*	getInstance(HWND inWnd);		//<	インスタンス取得
		static	void				releaseInstance(void);			//<	インスタンス解放

				void	initialize(HWND inWnd);						//<	初期化処理
				void	finishalize(void);							//<	解放処理
				void	flagChack(SCENE_FLAG inGFlag);				//<	受け取ったフラグをチェック

				HRESULT	main(void);									//<	メイン処理
	};
}
//-----------------------------------------------------------------------
//	ゲームアプリケーションの名前空間
//-----------------------------------------------------------------------