//***********************************************************************************
//!	ファイル名		Class_3DEffect.h
//
//	機能			3Dゲーム専用のエフェクトクラスの定義
//	記述			上岡　純
//	プロジェクト	未定
//	更新			2008/09/11	<新規>
//***********************************************************************************

#pragma	once

//-----------------------------------------------------------------------
//!	インターフェイスヘッダー
//-----------------------------------------------------------------------
#include	"Class_3DObject.h"				//!< 3Dオブジェクト
#include	"Class_EffectBase.h"			//!< エフェクトベース
#include	"Class_Spline.h"				//!< スプライン

//-----------------------------------------------------------------------
//!	3Dオブジェクトの名前空間
//-----------------------------------------------------------------------
namespace O3D
{
	//::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
	//!	名前空間の解放
	//::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
	using	namespace	EB;				//!< エフェクトベース
	using	namespace	SPL;			//!< スプライト

	//::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
	//!	クラス名		C3D_EFFECT
	//
	//	機能			三次元のエフェクト
	//	更新			2008/09/11	<新規>
	//::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
	class C3D_EFFECT : public C3D_OBJECT, public CEFFECT_BASE
	{
	private:		//-------------------- private --------------------//

				CSPLINE*	spMove;								//!< スプライン移動

				int			iCntFrame;							//!< フレームカウンタ
				int			iCntTex;							//!< テクスチャカウンタ
				int			iCntSize;							//!< サイズカウンタ
				int			iCntRotato;							//!< 回転カウンタ
				int			iCntMove;							//!< 移動カウンタ
				int			iCntColor;							//!< カラーカウンタ

				BOOL		bMotion;							//!< モーション実行確認
				VEC3		keepAngle;							//!< 維持角度

			//==================================================================
			//	スプライン生成
			//==================================================================
				void		createSpline(void);

	public:			//-------------------- public --------------------//

				C3D_EFFECT(CONST DEV   inDev,
						   CONST LPSTR inName,
						   VEC3		   inLoc,
						   CONST LPSTR inResource = PATH_EFFECTDATA,
						   CONST LPSTR inTexture  = PATH_EFFECTTEX);		//!< コンストラクタ
				C3D_EFFECT(void);											//!< コンストラクタ(空初期化)
				C3D_EFFECT(C3D_EFFECT* inCopy, VEC3 *inLoc, VEC3 *inAngle);	//!< コピー
		virtual	~C3D_EFFECT(void);											//!< デストラクタ

			//==================================================================
			//	モーション実行
			//==================================================================
		virtual	BOOL	motionEffect(void);

			//==================================================================
			//	モーション実行確認
			//==================================================================
				BOOL	getMotionBool(void)const		{ return	bMotion;		}
				void	setMotionBool(BOOL inMotion)	{ bMotion	= inMotion;		}

			//==================================================================
			//	カラーのセット(カラーの設定が出来るサブクラスでオーバーライド)
			//==================================================================
		virtual	void	setColor(D3DCOLOR inColor)		{ color.color	= inColor;	}

			//==================================================================
			//	コピー生成(サブクラスでオーバーライド可能)
			//==================================================================
		virtual	void	createCopy(C3D_OBJECT** inCopy, VEC3* inLoc, VEC3* inAngle)
				{
					*inCopy	= new C3D_EFFECT(this, inLoc, inAngle);
				}

			//==================================================================
			//	描画(サブクラスでオーバーライド可能)
			//==================================================================
		virtual	BOOL	draw(CONST DEV	  inDev);
		virtual	BOOL	draw(CONST SPRITE inSprite);
	};
}

//-----------------------------------------------------------------------
//!	3Dオブジェクトの名前空間
//-----------------------------------------------------------------------