//***********************************************************************************
//!	ファイル名		Class_EnemyShadollArchery.h
//
//	機能			敵キャラクタークラス「シャドールアーチェリー」の定義
//	記述			上岡　純
//	プロジェクト	[KageTokiGIRL]
//	更新			2009/02/20	<新規>
//***********************************************************************************

#pragma	once

//-----------------------------------------------------------------------
//!	インターフェイスヘッダー
//-----------------------------------------------------------------------
#include	"Class_KageTokiAdventEnemy.h"		//!< アドベンチャーゲームモード敵キャラクター
#include	"Class_Sound_OggVorbis.h"			//!< oggライブラリ(サウンドを発生させる為)

//-----------------------------------------------------------------------
//!	3Dオブジェクトの名前空間
//-----------------------------------------------------------------------
namespace O3D
{
	//::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
	//	シャドールアーチェリーの行動パターン
	//::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
	enum	ENEMYSHADOLLARCHERY_ACTION
	{
		eESHADOLLARCHERYA_WAIT,							//!< 待機時
		eESHADOLLARCHERYA_ARROWINIT,					//!< 矢の準備
		eESHADOLLARCHERYA_ARROW,						//!< 矢を射る
		eESHADOLLARCHERYA_MAX,							//!< 行動の最大数
	};

	//::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
	//!	クラス名		CENEMY_SHADOLL_ARCHERY
	//
	//	機能			アドベンチャーゲームモードの「シャドールアーチェリー」クラス
	//	更新			2009/02/20	<新規>
	//::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
	class	CENEMY_SHADOLL_ARCHERY : public CKAGETOKI_ADVENT_ENEMY
	{
			//==================================================================
			//	敵「シャドールアーチェリー」マクロ
			//==================================================================
				#define	NAME_SHADOLLARCHERY		"enemy_shadoll_archery"

	private:		//-------------------- private --------------------//

				ENEMYSHADOLLARCHERY_ACTION	action;					//!< シャドールアーチェリーの状態
				int				iAnimTemp[eESHADOLLARCHERYA_MAX];	//!< アニメーションテンプレート

				int				iHitFrame;					//!< 衝突点滅フレーム

			//==================================================================
			//	矢のオリジナル
			//==================================================================
				CENEMY_BALL*			originArrow;		//!< 矢のオリジナル
				SSTATIC*				ssArrowShot;		//!< 矢発射音

			//==================================================================
			//	サウンドデータ
			//==================================================================

			//==================================================================
			//	条件操作の処理分け
			//==================================================================
				void	opeWait(void);						//!< 待機時
				void	opeArrowInit(void);					//!< 矢の準備
				void	opeArrow(void);						//!< 矢を射る

				void	skillArrowShot(void);				//!< アローショット

	public:			//-------------------- public --------------------//

				CENEMY_SHADOLL_ARCHERY(
					CONST DEV	inDev,
					CONST LPSTR	inName     = NAME_SHADOLLARCHERY,
					CONST LPSTR	inResource = PATH_SKINMESH,
					CONST LPSTR	inTexture  = PATH_SKINMESHTEX);	//!< コンストラクタ
		virtual	~CENEMY_SHADOLL_ARCHERY(void);

			//==================================================================
			//	状態変化
			//==================================================================
				BOOL	changeAction(ENEMYSHADOLLARCHERY_ACTION inNewAction);

			//==================================================================
			//	リアクション(正式なアクションをするサブクラスでオーバーライド)
			//==================================================================
				void	reactionMessage(REACTION_MESSAGE inMessage);

			//==================================================================
			//	基本操作
			//==================================================================
				void	operation(CINPUT* input);

			//==================================================================
			//	描画
			//==================================================================
				BOOL	draw(CONST DEV inDev);
	};
}
//-----------------------------------------------------------------------
//!	3Dオブジェクトの名前空間
//-----------------------------------------------------------------------