//***********************************************************************************
//!	ファイル名		Class_SkinMesh.h
//
//	機能			スキンメッシュを扱うクラスの定義
//	記述			上岡　純
//	プロジェクト	未定
//	更新			2008/05/30	<追加>	コメント
//					2008/06/25	<追加>	全体的にコメントの強化
//***********************************************************************************

#pragma once

//-----------------------------------------------------------------------
//!	インターフェイスヘッダー
//-----------------------------------------------------------------------
#include	"Class_Mesh.h"						//!< 3Dオブジェクトメッシュ
#include	"Class_SkinMeshBase.h"				//!< スキンメッシュベース

//-----------------------------------------------------------------------
//!	3Dオブジェクトの名前空間
//-----------------------------------------------------------------------
namespace O3D
{
	//::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
	//!	名前空間の解放
	//::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
	using	namespace	SMB;		//!< スキンメッシュベース

	//::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
	//!	クラス名		CSKIN_MESH
	//
	//	機能			Xファイル形式のスキンメッシュ
	//::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
	class CSKIN_MESH : public C3D_OBJECT, public CSKIN_MESH_BASE
	{
	public:			//-------------------- public --------------------//

				CSKIN_MESH(CONST DEV   inDev,
						   CONST LPSTR inName,
						   CONST LPSTR inResource = PATH_SKINMESH,
						   CONST LPSTR inTexture  = PATH_SKINMESHTEX);	//!< コンストラクタ
				CSKIN_MESH(void);										//!< コンストラクタ(空初期化)
				CSKIN_MESH(CSKIN_MESH* inCopy);							//!< コピー
		virtual	~CSKIN_MESH(void);										//!< デストラクタ

			//==================================================================
			//	ワールド座標系の中心点
			//==================================================================
				VEC3	getWorldCenter(void);

			//==================================================================
			//	ワールド座標系の半径
			//==================================================================
				float	getWorldRadius(void){ return sd_ptr->mesh->localRadius * getScale();	}

			//==================================================================
			//	コピー生成(サブクラスでオーバーライド)
			//==================================================================
		virtual	void	createCopy(C3D_OBJECT** inCopy, VEC3* inLoc)
				{
					*inCopy	= new CSKIN_MESH(this);
					(*inCopy)->setLoc(inLoc);
				}

			//==================================================================
			//	描画(サブクラスでオーバーライド可能)
			//==================================================================
		virtual	BOOL	draw(CONST DEV inDev);
	};
}
//-----------------------------------------------------------------------
//!	3Dオブジェクトの名前空間
//-----------------------------------------------------------------------