//***********************************************************************************
//!	ファイル名		Class_KageTokiAdventBoss.h
//
//	機能			アドベンチャーゲームのボスベースクラスの定義
//	記述			上岡　純
//	プロジェクト	[KageTokiGIRL]
//	更新			2009/02/19	<新規>
//***********************************************************************************

#pragma	once

//-----------------------------------------------------------------------
//!	インターフェイスヘッダー
//-----------------------------------------------------------------------
#include	"Class_KageTokiAdventCharacter.h"	//!< アドベンチャーゲームモードキャラクター
#include	"Class_Sound_OggVorbis.h"			//!< oggライブラリ(サウンドを発生させる為)

//-----------------------------------------------------------------------
//!	3Dオブジェクトの名前空間
//-----------------------------------------------------------------------
namespace O3D
{
	//::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
	//!	クラス名		CKAGETOKI_ADVENT_BOSS
	//
	//	機能			アドベンチャーゲームのボスベースクラス
	//	更新			2009/02/19	<新規>
	//::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
	class	CKAGETOKI_ADVENT_BOSS : public CKAGETOKI_ADVENT_CHARACTER
	{
	//private:		//-------------------- private --------------------//
	protected:		//-------------------- protected --------------------//

				int				iMaxLife;					//!< 最大体力
				int				iLife;						//!< 残り体力

				BOOL				bDrawInterface;			//!< インターフェース描画確認
				TEX					interfaceTex;			//!< インターフェーステクスチャ
				CUSTOM_VERTEX_2D	lifeBase[4];			//!< 体力基盤
				CUSTOM_VERTEX_2D	lifeFrameBase[4];		//!< 体力の目盛の枠基盤
				CUSTOM_VERTEX_2D	lifeFrame[4];			//!< 体力の目盛の枠
				CUSTOM_VERTEX_2D	lifeChip[4];			//!< 体力の目盛

			//==================================================================
			//	外部ポインター
			//==================================================================
				CKAGETOKI_ADVENT_CHARACTER**	player;		//!< プレイヤー

				void	opeTurnToPlayer(void);				//!< プレイヤーの方を向く

	public:			//-------------------- public --------------------//

				CKAGETOKI_ADVENT_BOSS(
					CONST DEV	inDev,
					CONST LPSTR	inName,
					CONST LPSTR	inResource = PATH_SKINMESH,
					CONST LPSTR	inTexture  = PATH_SKINMESHTEX);	//!< コンストラクタ
		virtual	~CKAGETOKI_ADVENT_BOSS(void);					//!< デストラクタ

			//==================================================================
			//	access	プレイヤーの外部ポインター
			//==================================================================
				void	setTargetPlayer(CKAGETOKI_ADVENT_CHARACTER** inPlayer)
				{
					this->player	= inPlayer;
				}

			//==================================================================
			//	access	体力
			//==================================================================
				int		getMaxLife(void)const	{ return	iMaxLife;	}
				void	setMaxLife(int inValue)	{ iMaxLife	= inValue;	}
				int		getLife(void)const		{ return	iLife;		}
				void	setLife(int inValue)	{ iLife		= inValue;	}

			//==================================================================
			//	access	インターフェース描画確認
			//==================================================================
				BOOL	getDrawInterface(void)const		{ return	bDrawInterface;		}
				void	setDrawInterface(BOOL inBoolen)	{ bDrawInterface = inBoolen;	}

			//==================================================================
			//	リセット
			//==================================================================
		virtual	void	resetParameter(void);

			//==================================================================
			//	基本操作
			//==================================================================
		virtual	void	operation(CINPUT* input){}

			//==================================================================
			//	インターフェースの描画
			//==================================================================
				void	drawInterface(CONST DEV inDev);
	};
}
//-----------------------------------------------------------------------
//!	3Dオブジェクトの名前空間
//-----------------------------------------------------------------------