//***********************************************************************************
//!	ファイル名		Class_SceneStage1.h
//
//	機能			ゲームシーンクラス、ステージ1「公園」を定義
//	記述			上岡　純
//	プロジェクト	「」
//	更新			2008/11/27	<新規>
//***********************************************************************************

#pragma once

//-----------------------------------------------------------------------
//!	インターフェイスヘッダー
//-----------------------------------------------------------------------
#include	"Class_SceneAdventureGame.h"		//!< ゲームシーン
#include	"Class_EnemyShadoll.h"				//!< アドベンチャーエネミー「シャドール」
#include	"Class_EnemyShadollSword.h"			//!< アドベンチャーエネミー「シャドールソード」
#include	"Class_EnemyShadog.h"				//!< アドベンチャーエネミー「シャドッグ」

//-----------------------------------------------------------------------
//!	シーンの名前空間
//-----------------------------------------------------------------------
namespace SCE
{
	//::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
	//!	クラス名		CSCENE_STAGE1
	//
	//	機能			ゲームシーンクラス、ステージ1「公園」
	//	機能概要		アドベンチャーゲームクラスを継承している
	//					ステージ1はアドベンチャーゲームモード
	//	更新			2008/11/27	<新規>
	//::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
	class CSCENE_STAGE1 : public CSCENE_ADVENTURE_GAME
	{
	private:		//-------------------- private --------------------//

	public:			//-------------------- public --------------------//

				CSCENE_STAGE1(SCENE_SHARE_DATA* inData);		//!< コンストラクタ
		virtual	~CSCENE_STAGE1(void);							//!< デストラクタ

		virtual	void		sceneInitialize(int);				//!< 初期化
		virtual	void		sceneFinishalize(void);				//!< 解放

		virtual	SCENE_FLAG	sceneMain(CINPUT* input);			//!< シーンメイン

			//==================================================================
			//	ステージ1専用処理
			//==================================================================
				void		updateExecute(void);
	};
}
//-----------------------------------------------------------------------
//!	シーンの名前空間
//-----------------------------------------------------------------------