//***********************************************************************************
//!	ファイル名		Class_EnemyShadollSword.h
//
//	機能			敵キャラクタークラス「シャドールソード」の定義
//	記述			上岡　純
//	プロジェクト	[KageTokiGIRL]
//	更新			2009/01/19	<新規>
//***********************************************************************************

#pragma	once

//-----------------------------------------------------------------------
//!	インターフェイスヘッダー
//-----------------------------------------------------------------------
#include	"Class_KageTokiAdventEnemy.h"		//!< アドベンチャーゲームモード敵キャラクター
#include	"Class_Sound_OggVorbis.h"			//!< oggライブラリ(サウンドを発生させる為)

//-----------------------------------------------------------------------
//!	3Dオブジェクトの名前空間
//-----------------------------------------------------------------------
namespace O3D
{
	//::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
	//	シャドールソードの行動パターン
	//::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
	enum	ENEMYSHADOLLSWORD_ACTION
	{
		eESHADOLLSWORDA_WAIT,					//!< 待機時
		eESHADOLLSWORDA_WALK,					//!< 歩行時
		eESHADOLLSWORDA_ATTACK,					//!< 剣で攻撃時
		eESHADOLLSWORDA_MAX,					//!< 行動の最大数
	};

	//::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
	//!	クラス名		CENEMY_SHADOLL_SWORD
	//
	//	機能			アドベンチャーエネミーの「シャドールソード」クラス
	//	更新			2009/01/19	<新規>
	//::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
	class	CENEMY_SHADOLL_SWORD : public CKAGETOKI_ADVENT_ENEMY
	{
			//==================================================================
			//	敵「シャドールソード」マクロ
			//==================================================================
				#define	NAME_SHADOLLSWORD		"enemy_shadoll_sword"

	private:		//-------------------- private --------------------//

				ENEMYSHADOLLSWORD_ACTION	action;				//!< シャドールソードの状態
				int				iAnimTemp[eESHADOLLSWORDA_MAX];	//!< アニメーションテンプレート

				int				iHitFrame;						//!< 衝突点滅フレーム

			//==================================================================
			//	サウンドデータ
			//==================================================================
				int				stepCnt;					//!< ステップカウンタ
				SSTATIC*		sStaticStep;				//!< 足音
				SSTATIC*		sStaticJumpStart;			//!< ジャンプ音
				SSTATIC*		sStaticJumpEnd;				//!< 着地音

				void	soundStep(void);					//!< 足音の発生
				void	soundJumpStart(void);				//!< ジャンプの発生
				void	soundJumpEnd(void);					//!< 着地音

			//==================================================================
			//	条件操作の処理分け
			//==================================================================
				void	opeWait(void);						//!< 待機時
				void	opeWalk(void);						//!< 歩行時
				void	opeAttack(void);					//!< 剣で攻撃時

	public:			//-------------------- public --------------------//

				CENEMY_SHADOLL_SWORD(
					CONST DEV	inDev,
					CONST LPSTR	inName     = NAME_SHADOLLSWORD,
					CONST LPSTR	inResource = PATH_SKINMESH,
					CONST LPSTR	inTexture  = PATH_SKINMESHTEX);	//!< コンストラクタ
		virtual	~CENEMY_SHADOLL_SWORD(void);

			//==================================================================
			//	状態変化
			//==================================================================
				BOOL	changeAction(ENEMYSHADOLLSWORD_ACTION inNewAction);

			//==================================================================
			//	リアクション(正式なアクションをするサブクラスでオーバーライド)
			//==================================================================
				void	reactionMessage(REACTION_MESSAGE inMessage);

			//==================================================================
			//	基本操作
			//==================================================================
				void	operation(CINPUT* input);

			//==================================================================
			//	描画
			//==================================================================
				BOOL	draw(CONST DEV inDev);
	};
}
//-----------------------------------------------------------------------
//!	3Dオブジェクトの名前空間
//-----------------------------------------------------------------------