//***********************************************************************************
//!	ファイル名		Class_GameMap.h
//
//	機能			このゲーム専用の3Dマップの定義
//	記述			上岡　純
//	プロジェクト	「」
//	更新			2008/07/25	<新規>
//***********************************************************************************

#pragma	once

//-----------------------------------------------------------------------
//!	インターフェイスヘッダー
//-----------------------------------------------------------------------
#include	"Class_3DMap.h"					//!< 3Dオブジェクトマップ
#include	"Class_Mesh.h"					//!< 3Dオブジェクトメッシュ
#include	"Class_SkinMesh.h"				//!< 3Dオブジェクトスキンメッシュ
#include	"Class_Texture.h"				//!< 3Dオブジェクトスキンメッシュ

//-----------------------------------------------------------------------
//!	3Dオブジェクトの名前空間
//-----------------------------------------------------------------------
namespace O3D
{
	//::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
	//!	クラス名		CGAME_MAP
	//
	//	機能			このゲーム専用の3Dマップ
	//	更新			2008/07/25	<新規>
	//::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
	class CGAME_MAP : public C3D_MAP
	{
	private:		//-------------------- private --------------------//

				#define	NUM_FALSE	-10000

	protected:		//-------------------- protected --------------------//

				C3D_OBJECT_GROUP	friendG;						//!< 味方グループ
				C3D_OBJECT_GROUP	enemyG;							//!< 敵グループ

				float				fEnemyGDistance;				//!< 敵グループ描画領域

			//==================================================================
			//	オブジェクト生成
			//==================================================================
		virtual	BOOL	createObject(CONST DEV	  inDev,
									 C3D_OBJECT** inObj,
									 OB_DATA*	  inData);

			//==================================================================
			//	生成したオブジェクトのグループ登録
			//==================================================================
		virtual	BOOL	addObject(C3D_OBJECT* inObject, int inGroupType);

			//==================================================================
			//	オブジェクトのメッセージをチェック
			//==================================================================
		virtual	BOOL	checkMessage(vector<C3D_OBJECT*>::iterator* inObjP);

	public:			//-------------------- public --------------------//

				CGAME_MAP(	void);									//!< コンストラクタ
				CGAME_MAP(	CONST DEV	 inDev,
							int			 inTxtNum);					//!< コンストラクタ(全初期化)
		virtual	~CGAME_MAP(void);									//!< デストラクタ

		virtual	void	finalize(void);								//!< 解放

			//==================================================================
			//	access	味方グループ
			//==================================================================
				C3D_OBJECT_GROUP*	getFriendG(void)				{ return	&this->friendG;	}
				void				addFriendG(C3D_OBJECT* inObj)	{ this->friendG.add(inObj);	}

			//==================================================================
			//	access	敵グループ
			//==================================================================
				C3D_OBJECT_GROUP*	getEnemyG(void)					{ return	&this->enemyG;	}
				void				addEnemyG(C3D_OBJECT* inObj)	{ this->enemyG.add(inObj);	}
			//	敵グループの描画
				void				drawEnemyG(CONST DEV inDev, VEC3* inViewPoint);
				float	getEnemyGDistance(void)const			{ return	fEnemyGDistance;	}
				void	setEnemyGDistance(float inDist)			{ fEnemyGDistance	= inDist;	}
	};
}
//-----------------------------------------------------------------------
//!	3Dオブジェクトの名前空間
//-----------------------------------------------------------------------