//***********************************************************************************
//!	ファイル名		Class_SaveResource.cpp
//
//	機能			外部リソース保存用のクラスの実装
//	記述			上岡　純
//	プロジェクト	未定
//	更新			2009/01/28	<新規>
//***********************************************************************************

//-----------------------------------------------------------------------
//!	インターフェイスヘッダー
//-----------------------------------------------------------------------
#include	"Precompiler.h"

//-----------------------------------------------------------------------
//!	セーブリソースの名前空間
//-----------------------------------------------------------------------
namespace SAVER
{
	//================================================================================
	//	インスタンス生成場所
	//================================================================================
	CSAVE_RESOURCE*	CSAVE_RESOURCE::gUniqueInstance	= NULL;

	//================================================================================
	//!	メソッド名	CSAVE_RESOURCE::コンストラクタ
	//
	//	引数		inDev		Direct3Dデバイス
	//	更新		2009/01/28	<新規>
	//================================================================================
	CSAVE_RESOURCE::CSAVE_RESOURCE(DEV inDev)
	{
	//	初期化
		LOOP(OBJECT_VALUE)
		{
			saveMesh[i]		= NULL;
			saveSkinMesh[i]	= NULL;
			saveTexture[i]	= NULL;
		}
	//	生成
		saveSkinMesh[0]	= new CSKIN_MESH_BASE(inDev, "advent_kageo");
		saveSkinMesh[1]	= new CSKIN_MESH_BASE(inDev, "advent_kagemi");
	}

	//================================================================================
	//!	メソッド名	CSAVE_RESOURCE::デストラクタ
	//
	//	更新		2009/01/28	<新規>
	//================================================================================
	CSAVE_RESOURCE::~CSAVE_RESOURCE(void)
	{
	//	解放
		LOOP(OBJECT_VALUE)
		{
			SAFE_DELETE(saveMesh[i]);
			SAFE_DELETE(saveSkinMesh[i]);
			SAFE_DELETE(saveTexture[i]);
		}
	}

	//================================================================================
	//!	メソッド名	CSAVE_RESOURCE::getInstance
	//
	//	機能		インスタンスの取得
	//	引数		inDev		Direct3Dデバイス
	//	戻り値		インスタンスを返す
	//	更新		2009/01/28	<新規>
	//================================================================================
	CSAVE_RESOURCE*
	CSAVE_RESOURCE::getInstance(DEV inDev)
	{
	//!	生成されていなければ、生成する
		if(	!gUniqueInstance)
		{
		//!	インスタンス生成
			gUniqueInstance = new CSAVE_RESOURCE(inDev);
		}
	//!	インスタンスを返す
		return gUniqueInstance;
	}

	//================================================================================
	//!	メソッド名	CSAVE_RESOURCE::releaseInstance
	//
	//	機能		インスタンス解放
	//	更新		2009/01/28	<新規>
	//================================================================================
	void
	CSAVE_RESOURCE::releaseInstance(void)
	{
	//!	インスタンスの解放
		SAFE_DELETE(gUniqueInstance);
	}
}
//-----------------------------------------------------------------------
//!	セーブリソースの名前空間
//-----------------------------------------------------------------------