//***********************************************************************************
//!	ファイル名		Class_Texture.cpp
//
//	機能			テクスチャオブジェクトに関する実装
//	記述			上岡　純
//	プロジェクト	未定
//	更新			2008/08/27	<新規>
//***********************************************************************************

//-----------------------------------------------------------------------
//!	インターフェイスヘッダー
//-----------------------------------------------------------------------
#include	"Precompiler.h"

//#include	"Class_Texture.h"

//-----------------------------------------------------------------------
//!	3Dオブジェクトの名前空間
//-----------------------------------------------------------------------
namespace O3D
{
	//================================================================================
	//!	メソッド名	CTEXTURE::コンストラクタ
	//
	//	機能		テクスチャをロードして初期化
	//	引数		inDev		Direct3Dデバイス
	//				inName		Xファイルの名称
	//				inSize		サイズ
	//				inColor		透明化される色
	//				inResource	テクスチャフォルダ名
	//	更新		2008/08/28	<新規>
	//================================================================================
	CTEXTURE::CTEXTURE(CONST DEV	inDev,
					   CONST LPSTR	inName,
					   VEC2			inSize,
					   DWORD		inColor,
					   CONST LPSTR	inResource)		:
	CTEXTURE_BASE(inDev, inName, inSize, inColor, inResource)
	{
	//	スーパークラスの初期化
		C3D_OBJECT::initialize();
	//	もしテクスチャの読み込み失敗していたら、存在確認をOFFにする
		if(	!bTextureLoaded)	{ setVisible(FALSE); return; }
	//	描画元、描画先の初期化
		setFromRect(
			0, 0, texd_ptr->texInfo.Width, texd_ptr->texInfo.Height);
		setToRect(inSize);
	}

	//================================================================================
	//!	メソッド名	CTEXTURE::コンストラクタ
	//
	//	機能		空初期化
	//	更新		2008/08/28	<新規>
	//================================================================================
	CTEXTURE::CTEXTURE(void)	:
	CTEXTURE_BASE()
	{
	//	スーパークラスの初期化
		C3D_OBJECT::initialize();
	}

	//================================================================================
	//!	メソッド名	CTEXTURE::コンストラクタ
	//
	//	機能		コピー
	//	引数		inCopy		コピー元
	//	更新		2008/08/28	<新規>
	//================================================================================
	CTEXTURE::CTEXTURE(CTEXTURE* inCopy)	:
	CTEXTURE_BASE(inCopy)
	{
	//	スーパークラスの初期化
		C3D_OBJECT::initialize();
	//	もしテクスチャの読み込み失敗していたら、存在確認をOFFにする
		if(	!bTextureLoaded)	{ setVisible(FALSE); return; }
	}

	//================================================================================
	//!	メソッド名	CTEXTURE::デストラクタ
	//
	//	更新		2008/05/03	<新規>
	//================================================================================
	CTEXTURE::~CTEXTURE(void)
	{
	//	スーパークラスの開放
		C3D_OBJECT::finalize();
	}

	//================================================================================
	//!	メソッド名	CTEXTURE::draw
	//
	//	機能		描画(3D用)
	//	引数		inDev		Direct3Dデバイス
	//	更新		2008/05/03	<新規>
	//================================================================================
	BOOL
	CTEXTURE::draw(CONST DEV inDev)
	{
	//	存在しない状態なら、描画しない
		if(	!getVisible())	return FALSE;

	/*	if(	getDiffuseAlpha() < 0.0f)
		{
			setColorAlpha(255 - int(255.0f * (-getDiffuseAlpha())));
		}*/

		return	drawTexture(inDev, getWorldMatrix());
	}

	//================================================================================
	//!	メソッド名	CTEXTURE::draw
	//
	//	機能		描画(2D用)
	//	引数		inSprite	スプライトデバイス
	//	更新		2008/05/03	<新規>
	//================================================================================
	BOOL
	CTEXTURE::draw(CONST SPRITE inSprite)
	{
	//	存在しない状態なら、描画しない
		if(	!getVisible())	return FALSE;

	//	描画先更新
		setToRect(getShowSize());

		return	drawTexture(
					inSprite,
					rcFrom,
					rcTo,
					getLocZ(),
					NULL,
					D3DXToRadian(getAngleZ()),
					getColor());
	}
}
//-----------------------------------------------------------------------
//!	3Dオブジェクトの名前空間
//-----------------------------------------------------------------------