//***********************************************************************************
//!	ファイル名		Class_SceneLogo.h
//
//	機能			ロゴシーンの定義
//	記述			上岡　純
//	プロジェクト	「」
//	更新			2008/09/30	<新規>
//***********************************************************************************

#pragma once

//-----------------------------------------------------------------------
//!	インターフェイスヘッダー
//-----------------------------------------------------------------------
#include	"GameCommon.h"					//!< ゲームコモン
#include	"Class_Scene.h"					//!< シーン
#include	"Class_Sound_OggVorbis.h"		//!< oggライブラリ(サウンドを発生させる為)
#include	"Class_GraphicDevice.h"			//!< グラフィックデバイス

//-----------------------------------------------------------------------
//!	シーンの名前空間
//-----------------------------------------------------------------------
namespace SCE
{
	//::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
	//!	クラス名		CSCENE_LOGO
	//
	//	機能			タイトルシーンのクラス
	//	更新			2008/09/30	<新規>
	//					2009/01/24	<変更>書き直し
	//::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
	class CSCENE_LOGO : public CSCENE
	{
	private:		//-------------------- private --------------------//

			//==================================================================
			//	環境属性
			//==================================================================
				CGRAPHIC_DEVICE*	gDev;				//!< グラフィックデバイス
				C3D_EFFECT_CENTER*	effectCenter;		//!< エフェクトセンター

				int					iFrameCnt;			//!< フレームカウンタ
				int					iStepCnt;			//!< ステップカウンタ
				CTEXTURE*			logoJec;			//!< 日本電子専門学校ロゴ
				C3D_EFFECT*			logoProject;		//!< プロジェクトロゴ
				SSTATIC*			sStaLogo;			//!< ロゴ出現音

				BOOL				bEndCheck;			//!< 終了確認
				void				initEndCheck(void);	//!< 終了準備
				void				endCheck(void);		//!< 終了確認処理

	public:			//-------------------- public --------------------//

				CSCENE_LOGO(SCENE_SHARE_DATA* inData);
		virtual	~CSCENE_LOGO(void);

				void		sceneInitialize(int inStageNum);	//!< 初期化
				void		sceneFinishalize(void);				//!< 開放

				SCENE_FLAG	sceneMain(CINPUT* input);			//!< シーンメイン

				void		execute(CINPUT* input);				//!< 処理
				void		render(void);						//!< 描画
	};
}
//-----------------------------------------------------------------------
//!	シーンの名前空間
//-----------------------------------------------------------------------