//***********************************************************************************
//!	ファイル名		Class_SceneDemo.h
//
//	機能			デモのシーンを定義
//	記述			上岡　純
//	プロジェクト	「」
//	更新			2008/09/29	<新規>
//					2008/11/17	<変更>	ゲームシーンを継承
//***********************************************************************************

#pragma once

//-----------------------------------------------------------------------
//!	インターフェイスヘッダー
//-----------------------------------------------------------------------
#include	"Class_SceneAdventureGame.h"		//!< ゲームシーン

//-----------------------------------------------------------------------
//!	シーンの名前空間
//-----------------------------------------------------------------------
namespace SCE
{
	//::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
	//!	クラス名		CSCENE_DEMO
	//
	//	機能			デモシーンのクラス
	//	機能概要		ゲームシーンを継承している
	//					ゲームシーンにデモシーンの機能を追加しているだけ
	//	更新			2008/09/29	<新規>
	//::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
	class CSCENE_DEMO : public CSCENE_ADVENTURE_GAME
	{
			//==================================================================
			//	マクロ群
			//==================================================================
				#define	DEMO_STAGE_NUM		(rand() % 1) + 1 + 10000	//!< デモステージ番号乱数生成
				#define	DEMO_EFFECT_NUM		(rand() % 2) + 1			//!< デモエフェクト番号乱数生成
				#define	NAME_DEMO			"demo%d"					//!< デモエフェクトのパス

	private:		//-------------------- private --------------------//

			//==================================================================
			//	環境クラス
			//==================================================================
				C3D_EFFECT*		effDemo;						//!< デモ表示のエフェクト

				void	sdInitialize(void);						//!< デモの初期化
				void	sdFinishalize(void);					//!< デモの解放

	protected:		//-------------------- protected --------------------//

			//==================================================================
			//	オーバーライド処理
			//==================================================================
		virtual	void	sgEventRender(void);					//!< ゲームイベント中描画

	public:			//-------------------- public --------------------//

				CSCENE_DEMO(SCENE_SHARE_DATA* inData);
		virtual	~CSCENE_DEMO(void);

		virtual	void		sceneInitialize(int);				//!< 初期化
		virtual	void		sceneFinishalize(void);				//!< 解放

		virtual	SCENE_FLAG	sceneMain(CINPUT* input);			//!< シーンメイン
	};
}
//-----------------------------------------------------------------------
//!	シーンの名前空間
//-----------------------------------------------------------------------