//***********************************************************************************
//!	ファイル名		Class_Direction.h
//
//	機能			DirectX演出機能を拡張したクラスの定義
//	機能概要		DirectXの関数、機能をカプセル化し、
//					値を送るだけで、その値に応じた演出を実行出来る
//	記述			上岡　純
//	プロジェクト	未定
//	更新			2008/12/01	<新規>
//***********************************************************************************

#pragma once

//-----------------------------------------------------------------------
//!	インターフェイスヘッダー
//-----------------------------------------------------------------------
#include	"DirectX.h"				//!< DirectX使用

//-----------------------------------------------------------------------
//!	DXライブラリの名前空間
//-----------------------------------------------------------------------
namespace DX
{
	//::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
	//	塗り潰しタイプシネマスコープデータ
	//::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
	struct	CINEMASCOPE_PAINTOUT_DATA
	{
		TEX					texture;			//!< 塗り潰す絵
		CUSTOM_VERTEX_2D	surfaceTop[4];		//!< 上部塗り潰し頂点配列
		CUSTOM_VERTEX_2D	surfaceBottom[4];	//!< 下部塗り潰し頂点配列
	//	コンストラクタ
		CINEMASCOPE_PAINTOUT_DATA(void)
		{
			texture	= NULL;
			ZeroMemory(surfaceTop,   sizeof(surfaceTop));
			ZeroMemory(surfaceBottom,sizeof(surfaceBottom));
		}
	//	デストラクタ
		~CINEMASCOPE_PAINTOUT_DATA(void)
		{
			SAFE_RELEASE(texture);
		}
	};

	//::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
	//!	クラス名		CDIRECTION
	//
	//	機能			DirectX演出クラス
	//	更新			2008/04/21	<新規>
	//::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
	class CDIRECTION
	{
	private:		//-------------------- private --------------------//

			//==================================================================
			//	環境属性
			//==================================================================
				DEV		targetDevice;					//!< 対象Direct3Dデバイス
				int		iScreenSizeX;					//!< スクリーンサイズX軸
				int		iScreenSizeY;					//!< スクリーンサイズY軸

			//==================================================================
			//	演出属性
			//==================================================================
				CINEMASCOPE_PAINTOUT_DATA*	cspd;		//!<塗り潰しタイプシネマスコープデータ

	public:			//-------------------- public --------------------//

				CDIRECTION(DEV inDev, int inScreenSizeX, int inScreenSizeY);
		virtual	~CDIRECTION(void);

			//==================================================================
			//	演出メソッド群
			//==================================================================
			//	シネマスコープ(塗り潰しタイプ)
				void	initCinemaScopePaintOut(int inTopHeight, int inBottomHeight,
												float fPosZ, DWORD inColor, LPSTR inTexName = NULL);
				void	directCinemaScopePaintOut(void);
				void	releaseCinemaScopePaintOut(void);

			//==================================================================
			//	一括開放
			//==================================================================
				void	release(void)	{
					releaseCinemaScopePaintOut();
				}
	};
}
//-----------------------------------------------------------------------
//!	DXライブラリの名前空間
//-----------------------------------------------------------------------