//***********************************************************************************
//!	ファイル名		UtilityFunction.h
//
//	機能			このプログラムで使用する定数、マクロ、関数の定義
//	記述			上岡　純
//	プロジェクト	未定
//	更新			2008/04/17	<新規>
//***********************************************************************************

#pragma once

//-----------------------------------------------------------------------
//!	拡張機能
//-----------------------------------------------------------------------
#pragma comment(lib, "winmm")			//!< マルチメディア拡張機能を提供
#pragma comment(lib, "imm32.lib")		//!< IMEモードを変更するため

//-----------------------------------------------------------------------
//!	エラーコメントの制御
//-----------------------------------------------------------------------
#pragma warning(disable: 4819)
#pragma warning(disable: 4996)

//-----------------------------------------------------------------------
//!	インターフェイスヘッダー
//-----------------------------------------------------------------------
#include	<windows.h>
#include	<stdio.h>
#include	<stdlib.h>
#include	<string.h>
#include	<malloc.h>
#include	<process.h>
#include	<tchar.h>
#include	<math.h>
#include	<time.h>
#include	<iostream>
#include	<string>
#include	<vector>
#include	<map>
#include	<new>

using namespace std;

#define VS2005							//!< .NetのVersion管理用

//-----------------------------------------------------------------------
//!	安全解放関連
//-----------------------------------------------------------------------
#ifndef	SAFE_DELETE
#define	SAFE_DELETE(p)			{if(p){delete p;		p = NULL;}}
#endif
#ifndef	SAFE_DELETE_ARRAY
#define	SAFE_DELETE_ARRAY(p)	{if(p){delete[] p;		p = NULL;}}
#endif
#ifndef	SAFE_RELEASE
#define	SAFE_RELEASE(p)			{if(p){p->Release();	p = NULL;}}
#endif

//-----------------------------------------------------------------------
//!	ユーティリティの名前空間
//-----------------------------------------------------------------------
namespace UT
{
	//::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
	//	配列ポインターにNULLを入れる
	//::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
	#ifndef	INNULL_ARRAY
		#define	INNULL_ARRAY(p, num)				\
		{											\
			for(int i = 0; i < num; i++)			\
				p[i] = NULL;						\
		}
	#endif

	//::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
	//!	バージョンが変わっても引数が変わらない関数を、再定義
	//::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
	#ifdef VS2005
		#define	my_sprintf				sprintf_s
		#define my_fscanf				fscanf_s
		#define	my_strcpy				strcpy_s
		#define	my_strcat				strcat_s
	#else
		#define	my_sprintf				sprintf
		#define my_fscanf				fscanf
		#define	my_strcpy				strcpy
		#define	my_strcat				strcat
	#endif

	//::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
	//	統一マクロ群
	//::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
	#define PAI		3.14159265f				//!< 円周率

	//::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
	//	Utility関数
	//::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
	extern	FILE*	uf_FOpen(const char* szFileName, const char* szType);
	extern	void	uf_StrCpy1(LPSTR inDest, int inSizeDest, LPSTR inSource, int inSizeSource);
}
//-----------------------------------------------------------------------
//!	ユーティリティの名前空間
//-----------------------------------------------------------------------