//--------------------------------------------------------------------------------------------
//	ファイル名	：	version.h
//	アプリ名	：	汎用的なファイルなので、実行ファイルは不特定
//	作成者		：	植山沙欧
//	作成日		：	2007.02.09
//	機能		：	VisualStudio2005と2003の共存をするためのヘッダーです。
//	使用方法	：	VisualStudio2005以前の開発環境を使用するときはコメントアウトします。
//	更新履歴	：	2007.02.09	Ver1.00		植山沙欧	機能の実現
//--------------------------------------------------------------------------------------------
#include <windows.h>

#include	"Precompiler.h"

//#include	"Version.h"

//--------------------------------------------------------------------------------------------
//	暫定版（とりあえず文字列コピー）
//--------------------------------------------------------------------------------------------
void myCopyString(char* dest_ptr, int iDestSize, const char* source_ptr)
{
#ifdef VS2005 
	strcpy_s(dest_ptr, iDestSize, source_ptr);
#else
	strcpy(dest_ptr, source_ptr);
#endif
}

//--------------------------------------------------------------------------------------------
//	Scalar型で確保されたメモリの解放
//--------------------------------------------------------------------------------------------
void verDelete_Scalar(void** p)
{
	if(*p)
	{
		delete *p;
		*p = NULL;
	}
}

//--------------------------------------------------------------------------------------------
//	Vector型で確保されたメモリの解放
//--------------------------------------------------------------------------------------------
void verDelete_Vector(void** p)
{
	if(*p)
	{
		delete[] *p;
		*p = NULL;
	}
}

//--------------------------------------------------------------------------------------------
//	使用したハンドルを閉じます	
//--------------------------------------------------------------------------------------------
extern void verCloseHandle(void** h)
{
	if(*h)
	{
		CloseHandle(*h);
		*h = NULL;
	}
}